Repository: MestourBS/small-py-site
Catalog: translations/*/LC_MESSAGES/messages.po
Languages: fr

# auth_error_no_username
source: Error: No username
fr: Erreur: Pas de nom d'utilisateur

# auth_error_no_password
source: Error: No password
fr: Erreur: Pas de mot de passe

# auth_error_invalid_login
source: Error: Username or password is incorrect
fr: Erreur: Le nom d'utilisateur ou le mot de passe est incorrect

# auth_error_user_not_exist
source: Error: User does not exist
fr: Erreur: L'utilisateur n'existe pas

# auth_error_password_short
source: Error: Password must be at least %(chars)s characters long
fr: Erreur: Le mot de passe doit faire au moins %(chars)s caractères de long

# auth_error_passwords_not_match
source: Error: Both passwords must match
fr: Erreur: Les 2 mots de passes doivent être pareils

# auth_error_unknown
source: Unknown error
fr: Erreur inconnue

# auth_error_no_password_new
source: Error: No new password
fr: Erreur: Pas de nouveau mot de passe

# auth_error_wrong_password
source: Error: Old password is invalid
fr: Erreur: Le mot de passe précédent ne correspond pas

# group_error_no_name
source: Error: No group name
fr: Erreur: Pas de nom dde groupe

# chat_unknown_user
source: Unknown user
fr: Utilisateur inconnu

# game_blockus_theme_name_dark
source: Dark mode
fr: Mode sombre

# game_blockus_theme_name_light
source: Light mode
fr: Mode lumineux

# game_blockus_shape_square
source: Sqaure
fr: Carré

# game_blockus_unit_none
source: Scientist notation
fr: Raccourci scientific

# game_blockus_unit_si
source: SI notation
fr: Raccourci SI

# game_blockus_unit_numeral
source: Numeral notation
fr: Raccourci numérique

# game_blockus_action_move_shape_right
source: Move shape to the right
fr: Déplacer la forme à droite

# game_blockus_action_move_shape_left
source: Move shape to the left
fr: Déplacer la forme à gauche

# game_blockus_action_move_shape_down
source: Move shape down
fr: Déplacer la forme en bas

# game_blockus_action_game_state_pause
source: Pause
fr: Mettre sur pause

# game_blockus_action_game_state_playing
source: Resume
fr: Continuer

# game_blockus_action_rotate_shape_clockwise
source: Rotate shape clockwise
fr: Tourner la forme dans le sens des aiguilles

# game_blockus_action_rotate_shape_counter_clockwise
source: Rotate shape counter clockwise
fr: Tourner la forme dans le sens contraire des aiguilles

# game_blockus_reset_confirm
source: Do you want to reset your blockus?
fr: Remettre le blockus à zéro?

# game_blockus_action_reset_game
source: Reset game
fr: Remettre à zéro

# game_blockus_option_theme
source: Theme
fr: Jeu de couleur

# game_blockus_option_block_width
source: Block width
fr: Largeur d'un bloc

# game_blockus_warn_option_reset
source: This option will reset the game. Continue?
fr: Changer cette option va remettre votre jeu à zéro. Continuer?

# game_blockus_option_block_height
source: Block height
fr: Hauteur d'un bloc

# game_blockus_option_shape
source: Block shape
fr: Forme d'un bloc

# game_blockus_option_unit
source: Score unit
fr: Raccourci de score

# game_blockus_option_block_size_min
source: Minimum amount of blocks in a shape
fr: Mimimum de blocs dans une forme

# game_blockus_option_block_size_max
source: Maxmimum amount of blocks in a shape
fr: Maximum de blocs dans une forme

# game_blockus_option_board_width
source: Game width
fr: Largeur du jeu

# game_blockus_option_board_height
source: Game height
fr: Hauteur du jeu

# game_blockus_option_trim_score
source: Trim the trailing zeros
fr: Enlever les zéros qui suivent le score

# game_blockus_option_rainbow_shapes
source: Randomly colored shapes
fr: Couleurs de formes aléatoires

# game_blockus_option_rainbow_blocks
source: Randomly colored blocks
fr: Couleurs de blocs aléatoires

# game_blockus_option_painbow_mode
source: Constant rainbow mode
fr: Couleurs changent à chaque rafraichissement

# game_blockus_option_diagonals
source: Diagonals in shapes
fr: Formes avec des diagonales

# game_blockus_keybinds_group_playing
source: While playing
fr: En jeu

# game_blockus_keybinds_group_pause
source: While paused
fr: Sur pause

# game_blockus_keybinds_group_gameover
source: After losing
fr: Après une défaite

# game_blockus_keybind_leave_blank_tip
source: Leave blank to delete
fr: Laissez vide pour supprimer

# chat_confirm_delete_message
source: Are you sure you want to delete this message?
fr: Êtes-vous sûr de vouloir supprimer le message?

# games_idle_bosses_drops
source: Drops
fr: Trésors

# games_idle_buildings_cost
source: Cost
fr: Cout

# games_idle_buildings_damage
source: Damage
fr: Dégats

# games_idle_upgradess_cost
source: Cost
fr: Cout

# games_idle_upgradess_multipliers
source: Effects
fr: Effets

# games_idle_trait_none
source: None
fr: Aucun

# games_idle_trait_magic
source: Magic
fr: Magique

# games_idle_trait_earth
source: Earth
fr: Terre

# games_idle_trait_fire
source: Fire
fr: Feu

# games_idle_trait_water
source: Water
fr: Eau

# games_idle_trait_sound
source: Sound
fr: Son

# games_idle_trait_metal
source: Metal
fr: Métal

# games_idle_trait_electricity
source: Electric
fr: Electrique

# games_idle_trait_ice
source: Ice
fr: Glace

# games_idle_boss_small_dummy
source: Small dummy
fr: Petit mannequin

# games_idle_boss_medium_dummy
source: Medium dummy
fr: Mannequin moyen

# games_idle_boss_big_dummy
source: Big dummy
fr: Grand mannequin

# games_idle_boss_crash_dummy
source: Crash test dummy
fr: Mannequin de crash

# games_idle_boss_boss_dummy
source: Boss dummy
fr: Boss mannequin

# games_idle_boss_clear_slime
source: Clear slime
fr: Slime clair

# games_idle_boss_red_slime
source: Red slime
fr: Slime rouge

# games_idle_boss_green_slime
source: Green slime
fr: Slime vert

# games_idle_boss_blue_slime
source: Blue slime
fr: Slime bleu

# games_idle_boss_yellow_slime
source: Yellow slime
fr: Slime jaune

# games_idle_boss_magenta_slime
source: Magenta slime
fr: Slime magenta

# games_idle_boss_cyan_slime
source: Cyan slime
fr: Slime cyan

# games_idle_boss_white_slime
source: White slime
fr: Slime blanc

# games_idle_boss_black_slime
source: Black slime
fr: Slime noir

# games_idle_boss_giant_slime
source: Giant slime
fr: Slime géant

# games_idle_boss_infinity
source: Infinity
fr: L'infini

# games_idle_resource_knowledge
source: Knowledge
fr: Connaissances

# games_idle_resource_magic_powder
source: Magic powder
fr: Poudre magique

# games_idle_resource_common_loot
source: Common loot
fr: Butin basique

# games_idle_resource_dust
source: Dust
fr: Poussière

# games_idle_resource_pebbles
source: Pebbles
fr: Caillous

# games_idle_resource_embers
source: Embers
fr: Embres

# games_idle_resource_droplets
source: Droplets
fr: Goutelettes

# games_idle_resource_waves
source: Waves
fr: Ondes

# games_idle_resource_scraps
source: Scraps
fr: ferailles

# games_idle_resource_sparks
source: Sparks
fr: Etincelles

# games_idle_resource_snowflakes
source: Snowflakes
fr: Flocons de neige

# games_idle_resource_relics
source: Relics
fr: Reliques

# games_idle_resource_magic_shards
source: Magic shards
fr: Bris de magie

# games_idle_resource_uncommon_loot
source: Uncommon loot
fr: Butin peu commun

# games_idle_resource_dust_balls
source: Dust balls
fr: Boules de poussière

# games_idle_resource_rocks
source: Rocks
fr: Pierres

# games_idle_resource_drops
source: Drops
fr: Gouttes

# games_idle_resource_nuggets
source: Nuggets
fr: Pépites

# games_idle_resource_mush
source: Mush
fr: Neige liquide

# games_idle_building_puncher
source: Puncher
fr: Frappeur

# games_idle_building_dancer
source: Dancer
fr: Danceur

# games_idle_building_knight
source: Knight
fr: Chevalier

# games_idle_building_king
source: King
fr: Roi

# games_idle_building_apprentice
source: Apprentice
fr: Apprenti magicien

# games_idle_building_magician
source: Magician
fr: Magicien

# games_idle_building_wizard
source: Wizard
fr: Sorcier

# games_idle_building_fairy
source: Fairy
fr: Fée

# games_idle_building_fan
source: Fan
fr: Ventilateur

# games_idle_building_wind
source: Wind
fr: Vent

# games_idle_building_bird
source: Bird
fr: Oiseau

# games_idle_building_tornado
source: Tornado
fr: tornade

# games_idle_building_slingshot
source: Slingshot
fr: Lance-pierre

# games_idle_prestige_0
source: Soft reset
fr: Recommencer

# games_idle_prestige_0_confirm
source: Are you sure you want to reset? You will lose all your progress since the last prestige
fr: Etes-vous sûr de vouloir recommencer? Vous allez perdre tout votre progrès depuis votre dernier prestige

# games_idle_prestige_1_confirm
source: Are you sure you want to prestige? You will lose all your progress since the last prestige but gain new resources
fr: Etes-vous sûr de vouloir faire un prestige? Vous allez predre tout votre progrès depuis votre dernier prestige, mais vous allez gagner des nouvelle ressources

# games_cidle_tab_world
source: World
fr: Monde

# games_cidle_tab_help
source: Help
fr: Aide

# games_cidle_help_machine_title
source: About machines
fr: A propos des machines

# games_cidle_help_machine_intro
source: Machines can produce, consume, and store resources, making them useful.
fr: Les machines peuvent produire, consommer, et stocker des ressources, ce qui les rends utiles.

# games_cidle_help_machine_pane
source: Clicking on a machine will open a pane that shows the machine's contents, production, and so on.
fr: En cliquant sur une machine, il est possible de voir ce qu'elle contient, produit, etc.

# games_cidle_help_machine_type
source: Processing machines can either have fixed or scaling production. Fixed production will always be what is shown, while scaling production will instead scale with the amount of available resources. Scaling production can be limited by the machine's requirements.
fr: Les machines d'assemblage peuvent être de type fixé ou proportionnel. Le type fixé produit uniquement ce qui est affiché, alors que le type proportionnel va dépendre des ressources disponibles. Le type proportionnel peut être limité par des besoins.

# games_cidle_help_machine_pause
source: Processing machines can be paused and unpaused either by right-clicking them or by clicking the paused button in its pane. A paused machine does nothing.
fr: Une machine d'assemblage peut être mise sur pause en faisant un clic droit dessus ou en pressant le bouton pause dans son panneau. Une machine sur pause ne fait rien.

# games_cidle_help_machine_move
source: Machines can also be moved around by shift clicking on them. By default they will snap to the grid, but that can be disabled by holding shift.
fr: Les machines peuvent être déplacées en pressant majuscule et en faisant un clic dessus en même temps. Par défaut, le placement sera aligné à la grille, mais il est possible d'éviter ça en pressant majuscule.

# games_cidle_style_light
source: Light
fr: Clair

# games_cidle_maker_paused
source: Paused
fr: Sur pause

# games_cidle_maker_unpaused
source: Not Paused
fr: Pas sur pause

# games_cidle_maker_unpausable
source: Unpausable
fr: Ne peut pas être sur pause

# games_cidle_machine_move
source: Move
fr: Déplacer

# games_cidle_maker_type_fixed
source: Production is fixed
fr: La production est fixée

# games_cidle_maker_type_scaling
source: Production is scaling
fr: La production est proportionnelle

# games_cidle_machine_upgrading
source: Upgrade %(obj)s
fr: Améliorer %(obj)s

# games_cidle_machine_upgrade
source: Upgrade
fr: Amélioration

# games_cidle_machine_upgrade_costs
source: Upgrade Cost
fr: Cout d'amélioration

# games_cidle_resource_wood
source: Wood
fr: Bois

# games_cidle_resource_stone
source: Stone
fr: Pierre

# games_cidle_resource_fire
source: Fire
fr: Feu

# games_cidle_resource_water
source: Water
fr: Eau

# games_cidle_resource_time
source: Time
fr: Temps

# games_rpg_action_move_player_left
source: Move player to the left
fr: Déplacer le joueur à gauche

# games_rpg_action_move_player_right
source: Move player to the right
fr: Déplacer le joueur à droite

# games_rpg_action_move_player_down
source: Move player down
fr: Déplacer le joueur en bas

# games_rpg_action_move_player_up
source: Move player up
fr: Déplacer le joueur en haut

# games_rpg_action_move_cursor_inventory_left
source: Move inventory cursor to the left
fr: Déplacer le curseur de l'inventaire à gauche

# games_rpg_action_move_cursor_inventory_right
source: Move inventory cursor to the right
fr: Déplacer le curseur de l'inventaire à droite

# games_rpg_action_move_cursor_inventory_down
source: Move inventory cursor down
fr: Déplacer le curseur de l'inventaire en bas

# games_rpg_action_move_cursor_inventory_up
source: Move inventory cursor up
fr: Déplacer le curseur de l'inventaire en haut

# games_rpg_action_move_cursor_status_down
source: Move status cursor down
fr: Déplacer le curseur du status en bas

# games_rpg_action_move_cursor_status_up
source: Move status cursor up
fr: Déplacer le curseur du status en haut

# games_rpg_action_move_cursor_skill_select_up
source: Move skill selection cursor up
fr: Déplacer le curseur de sélection de capacités en haut

# games_rpg_action_move_cursor_skill_select_down
source: Move skill selection cursor down
fr: Déplacer le curseur de sélection de capacités en bas

# games_rpg_action_move_cursor_skill_select_left
source: Move skill selection cursor to the left
fr: Déplacer le curseur de sélection de capacités à gauche

# games_rpg_action_move_cursor_skill_select_right
source: Move skill selection cursor to the right
fr: Déplacer le curseur de sélection de capacités à droite

# games_rpg_action_move_cursor_skill_target_up
source: Move skill targeting cursor up
fr: Déplacer le curseur de ciblage de capacité en haut

# games_rpg_action_move_cursor_skill_target_down
source: Move skill targeting cursor down
fr: Déplacer le curseur de ciblage de capacité en bas

# games_rpg_action_move_cursor_skill_target_left
source: Move skill targeting cursor to the left
fr: Déplacer le curseur de ciblage de capacité à gauche

# games_rpg_action_move_cursor_skill_target_right
source: Move skill targeting cursor to the right
fr: Déplacer le curseur de ciblage de capacité à droite

# games_rpg_action_move_cursor_options_up
source: Move options cursor up
fr: Déplacer le curseur des options en haut

# games_rpg_action_move_cursor_options_down
source: Move options cursor down
fr: Déplacer le curseur des options en bas

# games_rpg_action_use_inventory_selected
source: Use selected item
fr: Utiliser l'objet sélectionné

# games_rpg_action_drop_inventory_selected
source: Drop selected item
fr: Lacher l'objet sélectionné

# games_rpg_action_toggle_equip_inventory_selected
source: Equip/unequip selected item
fr: Equipper l'objet sélectionné

# games_rpg_action_select_skill_selected
source: Use cast selected skill
fr: Utiliser la capacité sélectionné

# games_rpg_action_use_skill
source: Use skill
fr: Utiliser la capacité

# games_rpg_action_level_skill
source: Level up skill
fr: Améliorer la capacité

# games_rpg_action_call_option
source: Option dependant
fr: Dépend de l'option

# games_rpg_action_game_pause
source: Pause
fr: Mettre sur pause

# games_rpg_action_game_resume
source: Resume
fr: Continuer

# games_rpg_action_game_pause_toggle
source: Toggle pause
fr: Activer/désactiver le mode pause

# games_rpg_action_show_inventory
source: Show inventory
fr: Voir l'inventaire

# games_rpg_action_hide_inventory
source: Hide inventory
fr: Cacher l'inventaire

# games_rpg_action_show_status
source: Show status
fr: Voir le status

# games_rpg_action_hide_status
source: Hide status
fr: Cacher le status

# games_rpg_action_show_skills
source: Show skills
fr: Voir les capacités

# games_rpg_action_hide_skills
source: Hide skills
fr: Cacher les capacités

# games_rpg_action_change_skill
source: Change skill
fr: Changer la capacité

# games_rpg_action_cancel_skill
source: Cancel skill
fr: Annuler la capacité

# games_rpg_action_show_minimap
source: Show minimap
fr: Voir la carte

# games_rpg_action_hide_minimap
source: Hide minimap
fr: Cacher la carte

# games_rpg_action_show_options_test
source: Show test options
fr: Voir les options de test

# games_rpg_action_open_context_menu
source: Open context menu
fr: Ouvrir le menu contextuel

# games_rpg_item_has_passive
source: With passive effect
fr: A des effets passifs

# games_rpg_item_can_use
source: Can be used
fr: Peut être utilisé

# games_rpg_item_can_equip
source: Can be equipped
fr: Peut être équippé

# games_rpg_type_none
source: None
fr: Aucun

# games_rpg_status_health
source: Health
fr: Vie

# games_rpg_status_health_max
source: Max Health
fr: Vie Max

# games_rpg_status_magic
source: Magic
fr: Magie

# games_rpg_status_magic_max
source: Max Magic
fr: Magie Max

# games_rpg_status_speed
source: Speed
fr: Vitesse

# games_rpg_status_range
source: Range
fr: Portée

# games_rpg_status_kills
source: Kills
fr: Entité(s) tuée(s)

# games_rpg_status_inventory
source: Inventory
fr: Inventaire

# games_rpg_status_skills
source: Skills
fr: Capacités

# games_rpg_status_skills_total_levels
source: total levels
fr: niveaux totaux

# games_rpg_status_defense
source: %(type)s Defense
fr: Défense %(type)s

# games_rpg_status_damage
source: %(type)s Damage
fr: Dégats %(type)s

# games_rpg_slot_head
source: Head
fr: Tête

# games_rpg_slot_face
source: Face
fr: Visage

# games_rpg_slot_neck
source: Neck
fr: Cou

# games_rpg_slot_chest
source: Chest
fr: Torse

# games_rpg_slot_arm
source: Arm
fr: Bras

# games_rpg_slot_hand
source: Hand
fr: Main

# games_rpg_slot_leg
source: Leg
fr: Jambe

# games_rpg_slot_foot
source: Foot
fr: Pied

# games_rpg_status_name
source: Name
fr: Nom

# games_rpg_status_name_unnamed
source: Unnamed
fr: Sans nom

# games_rpg_status_on_use
source: On use
fr: Sur utilisation

# games_rpg_status_passive
source: Passive
fr: Passif

# games_rpg_status_equipped
source: When equipped
fr: Quand équipé

# games_rpg_status_equip_slot
source: Equipment slot %(slot)s
fr: Equipé sur %(slot)s

# games_rpg_status_faction
source: Faction
fr: Groupe

# games_rpg_status_items
source: items
fr: objets

# games_rpg_status_item
source: item
fr: objet

# games_rpg_status_cost
source: Cost
fr: Coût

# games_rpg_status_level_cost
source: Level-up Cost
fr: Coût d'un niveau

# games_rpg_status_on_use_self
source: On use on self
fr: Sur utilisation sur soi

# games_rpg_status_on_use_target
source: On use on a target
fr: Sur utilisation sur cible

# games_rpg_themes_dark
source: Dark mode
fr: Mode sombre

# games_rpg_faction_null
source: Unaffiliated
fr: Sans groupe

# games_rpg_faction_player
source: Player
fr: Joueur

# games_rpg_faction_anti_player
source: Anti player
fr: Anti joueur

# games_rpg_items_no
source: No
fr: Non

# games_rpg_items_yes
source: Yes
fr: Oui

# games_rpg_items_cake
source: Cake
fr: Gateau

# games_rpg_items_bricks
source: Bricks
fr: Briques

# games_rpg_items_sparks
source: Sparks
fr: Etincelles

# games_rpg_items_flag
source: Flag
fr: Drapeau

# games_rpg_items_gift
source: Gift
fr: Cadeau

# games_rpg_items_clover
source: Clover
fr: Trèfle

# games_rpg_items_fire
source: Fire
fr: Feu

# games_rpg_items_cash
source: Cash
fr: Argent

# games_rpg_items_video_game
source: Video Game
fr: Jeu Vidéo

# games_rpg_skills_rest
source: Rest
fr: Repos

# games_rpg_skills_see
source: Look around
fr: Vision

# games_rpg_skills_stab
source: Stab
fr: Poignarder

source: Register
fr: Créer un compte

source: Login
fr: Se connecter

# logged_in_as
source: Logged in as %(username)s
fr: Connecté en tant que %(username)s

source: Log out
fr: Se déconnecter

# home_view_chat
source: Go to the chat
fr: Aller aux discussions

source: Password
fr: Mot de passe

# password_new
source: New Password
fr: Nouveau mot de passe

source: Confirm password
fr: Confirmer le mot de passe

source: Cancel
fr: Annuler

source: Change password
fr: Changer le mot de passe

source: Username
fr: Nom d'utilisateur

# group_create
source: Create a chat
fr: Créer un groupe

source: Group name
fr: Nom du groupe

# group_invite
source: Invite to group
fr: Inviter au groupe

source: Group list
fr: Liste des groupes

# group_leave
source: Leave group
fr: Quitter le groupe

# chat_send_message
source: Send message
fr: Envoyer le message

# error_404
source: 404 error
fr: Erreur 404

# blockus_game_keybinds
source: Keybinds
fr: Contrôles

source: Games
fr: Jeux
